fonecmid-diplom/src/DataProcessors/ВКМ_ЗаполнениеГрафика/ВКМ_ЗаполнениеГрафика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_ЗаполнениеГрафика</name>
</mdclass:DataProcessor>

fonecmid-diplom/src/InformationRegisters/ВКМ_График/ВКМ_График.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_График</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>График</name>
    <type>
      <types>CatalogRef.ВКМ_График</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/DataProcessors/ВКМ_ЗаполнениеГрафика/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ГрафикРаботы) Экспорт 
	
	Если ГрафикРаботы.Наименование = "5/2" Тогда	
		
		Набор = РегистрыСведений.ВКМ_График.СоздатьНаборЗаписей(); 
		Набор.Отбор.График.Установить(ГрафикРаботы);
		Набор.Очистить();
		
		ТекущаяДата = НачалоДня(ДатаНачала);
		
		Пока ТекущаяДата <= КонецДня(ДатаОкончания) Цикл
			
			ДеньНедели = ДеньНедели(ТекущаяДата);
			ЗначениеДня = 0;
			
			Если ДеньНедели >= 1 И ДеньНедели <= 5 Тогда
				Если НЕ ЭтоПраздник(ТекущаяДата) Тогда
					ЗначениеДня = 8; 
				КонецЕсли;
			КонецЕсли;
			
			НоваяЗапись = Набор.Добавить();
			НоваяЗапись.Дата = ТекущаяДата;
			НоваяЗапись.График = ГрафикРаботы;
			НоваяЗапись.Значение = ЗначениеДня;
			
			ТекущаяДата = ТекущаяДата + 86400; 
			
		КонецЦикла;		
		Набор.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоПраздник(Дата)
	
	ПраздничныеДни = ПолучитьПраздничныеДни(Год(Дата));
	
	Для Каждого ПраздникДата Из ПраздничныеДни Цикл
		Если НачалоДня(ПраздникДата) = НачалоДня(Дата) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьПраздничныеДни(Год)
	
	ПраздникиМассив = Новый Массив;
	
	// Новогодние каникулы
	ПраздникиМассив.Добавить(Дата(Год, 1, 1));
	ПраздникиМассив.Добавить(Дата(Год, 1, 2));
	ПраздникиМассив.Добавить(Дата(Год, 1, 3));
	ПраздникиМассив.Добавить(Дата(Год, 1, 4));
	ПраздникиМассив.Добавить(Дата(Год, 1, 5));
	ПраздникиМассив.Добавить(Дата(Год, 1, 6));
	ПраздникиМассив.Добавить(Дата(Год, 1, 7));
	ПраздникиМассив.Добавить(Дата(Год, 1, 8));
	
	// Остальные праздники
	ПраздникиМассив.Добавить(Дата(Год, 2, 23));  // День защитника Отечества
	ПраздникиМассив.Добавить(Дата(Год, 3, 8));   // Международный женский день
	ПраздникиМассив.Добавить(Дата(Год, 5, 1));   // Праздник Весны и Труда
	ПраздникиМассив.Добавить(Дата(Год, 5, 9));   // День Победы
	ПраздникиМассив.Добавить(Дата(Год, 6, 12));  // День России
	ПраздникиМассив.Добавить(Дата(Год, 11, 4));  // День народного единства
	
	Возврат ПраздникиМассив;
	
КонецФункции

#КонецОбласти 

#КонецЕсли
